; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v2 - type_2 ?v8 - type_1)
 	      (pred_4 ?v3 - object ?v8 - type_1)
	      (pred_3 ?v2 - type_2 ?v5 - type_3)
	      (pred_2 ?v2 - type_2 ?v3 - object ?v5 - type_3))

   (:action op_2
       :parameters  (?v2 - type_2 ?v7 ?v4 - type_1)
       :precondition (and  (pred_1 ?v2 ?v7))
       :effect (and  (pred_1 ?v2 ?v4)
		     (not (pred_1 ?v2 ?v7))))

   (:action op_3
       :parameters (?v2 - type_2 ?v1 - object ?v6 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_4 ?v1 ?v6) (pred_1 ?v2 ?v6) (pred_3 ?v2 ?v5))
       :effect (and (pred_2 ?v2 ?v1 ?v5)
		    (not (pred_4 ?v1 ?v6)) 
		    (not (pred_3 ?v2 ?v5))))

   (:action op_1
       :parameters (?v2 - type_2 ?v1 - object ?v6 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_2 ?v2 ?v1 ?v5) (pred_1 ?v2 ?v6))
       :effect (and (pred_4 ?v1 ?v6)
		    (pred_3 ?v2 ?v5)
		    (not (pred_2 ?v2 ?v1 ?v5)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_12 obj_01 - type_2
obj_09 obj_13 obj_02 obj_10 - type_3
obj_08 obj_04 obj_06 obj_11 - type_1
obj_03 obj_05 obj_07 - object)
(:init
(pred_1 obj_12 obj_06)
(pred_3 obj_12 obj_09)
(pred_3 obj_12 obj_13)
(pred_1 obj_01 obj_11)
(pred_3 obj_01 obj_02)
(pred_3 obj_01 obj_10)
(pred_4 obj_03 obj_06)
(pred_4 obj_05 obj_04)
(pred_4 obj_07 obj_08)
)
(:goal
(and
(pred_4 obj_03 obj_11)
(pred_4 obj_05 obj_04)
(pred_4 obj_07 obj_11)
)
)

(:constraints
  (and
    (always (not (and (pred_1 obj_12 obj_11) (pred_1 obj_01 obj_11))))
  )
)
)

; plan
1. (op_3 obj_12 obj_03 obj_06 obj_13)
   deleted: (pred_4 obj_03 obj_06) (pred_3 obj_12 obj_13)
   added: (pred_2 obj_12 obj_03 obj_13)
   goals met: 1 of 3
2. (op_2 obj_01 obj_11 obj_08)
   deleted: (pred_1 obj_01 obj_11)
   added: (pred_1 obj_01 obj_08)
   goals met: 1 of 3
3. (op_2 obj_12 obj_06 obj_08)
   deleted: (pred_1 obj_12 obj_06)
   added: (pred_1 obj_12 obj_08)
   goals met: 1 of 3
4. (op_3 obj_12 obj_07 obj_08 obj_09)
   deleted: (pred_4 obj_07 obj_08) (pred_3 obj_12 obj_09)
   added: (pred_2 obj_12 obj_07 obj_09)
   goals met: 1 of 3
5. (op_2 obj_12 obj_08 obj_11)
   deleted: (pred_1 obj_12 obj_08)
   added: (pred_1 obj_12 obj_11)
   goals met: 1 of 3
6. (op_1 obj_12 obj_07 obj_11 obj_09)
   deleted: (pred_2 obj_12 obj_07 obj_09)
   added: (pred_4 obj_07 obj_11) (pred_3 obj_12 obj_09)
   goals met: 2 of 3
7. (op_1 obj_12 obj_03 obj_11 obj_13)
   deleted: (pred_2 obj_12 obj_03 obj_13)
   added: (pred_4 obj_03 obj_11) (pred_3 obj_12 obj_13)
   goals met: 3 of 3
